ews/examples/GenResParams-SOC-Example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:mes="http://www.ercot.com/schema/2007-06/nodal/ews/message">
    <soapenv:Header/>
    <soapenv:Body>
        <ns0:RequestMessage xmlns:ns0="http://www.ercot.com/schema/2007-06/nodal/ews/message">
            <ns0:Header>
                <ns0:Verb>create</ns0:Verb>
                <ns0:Noun>ResParametersSet</ns0:Noun>
                <ReplayDetection>
                    <Nonce>1359652204</Nonce>
                    <Created>2024-05-06T17:53:33.817-05:00</Created>
                </ReplayDetection>
                <ns0:Revision>001</ns0:Revision>
                <ns0:Source>QSAMP</ns0:Source>
                <ns0:UserID>userID12</ns0:UserID>
                <ns0:MessageID>244297</ns0:MessageID>
                <ns0:Comment>N/A</ns0:Comment>
            </ns0:Header>
            <Payload>
                <ResParametersSet>
                    <GenResourceParameters>
                        <externalId>3885</externalId>
                        <resource>RES1</resource>
                        <normalRrCurve>
                            <rrPoint>
                                <rampRateUp>2.0</rampRateUp>
                                <rampRateDown>2.0</rampRateDown>
                                <breakPoint>1.0</breakPoint>
                            </rrPoint>
                            <rrPoint>
                                <rampRateUp>5.0</rampRateUp>
                                <rampRateDown>5.0</rampRateDown>
                                <breakPoint>25.0</breakPoint>
                            </rrPoint>
                        </normalRrCurve>
                        <emergencyRrCurve>
                            <rrPoint>
                                <rampRateUp>2.0</rampRateUp>
                                <rampRateDown>2.0</rampRateDown>
                                <breakPoint>1.0</breakPoint>
                            </rrPoint>
                            <rrPoint>
                                <rampRateUp>5.0</rampRateUp>
                                <rampRateDown>5.0</rampRateDown>
                                <breakPoint>25.0</breakPoint>
                            </rrPoint>
                        </emergencyRrCurve>
                        <Details>
                            <minOnlineTime>1.0</minOnlineTime>
                            <minOfflineTime>1.0</minOfflineTime>
                            <maxOnlineTime>17520.0</maxOnlineTime>
                            <maxDailyStarts>2</maxDailyStarts>
                            <hotStartTime>1.2</hotStartTime>
                            <intermediateStartTime>5.3</intermediateStartTime>
                            <coldStartTime>1446.1</coldStartTime>
                            <hotToIntermediateTime>18.0</hotToIntermediateTime>
                            <intermediateToColdTime>232.0</intermediateToColdTime>
                            <maxWeeklyStarts>14</maxWeeklyStarts>
                            <maxWeeklyEnergy>67704</maxWeeklyEnergy>
                        </Details>
                        <SOC>
                            <minSOC>1</minSOC>
                            <maxSOC>20</maxSOC>
                            <roundTripEfficiency>0</roundTripEfficiency>
                        </SOC>
                        <reason>QSE Update</reason>
                    </GenResourceParameters>
                </ResParametersSet>
            </Payload>
        </ns0:RequestMessage>
    </soapenv:Body>
</soapenv:Envelope>
