ews/examples/ASOnlyOffer-Example.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RequestMessage xmlns="http://www.ercot.com/schema/2007-06/nodal/ews/message">
            <Header>
                <Verb>create</Verb>
                <Noun>BidSet</Noun>
                <ReplayDetection>
                    <Nonce>1359652204</Nonce>
                    <Created>2024-05-06T17:53:33.817-05:00</Created>
                </ReplayDetection>
                <Revision>1</Revision>
                <Source>QSAMP</Source>
                <UserID>userID12</UserID>
                <MessageID>abc</MessageID>
                <Comment>comment</Comment>
            </Header>
            <Payload>
                <BidSet>
                    <tradingDate>2024-05-01</tradingDate>
                    <ASOnlyOffer>
                        <startTime>2024-05-01T00:00:00-05:00</startTime>
                        <endTime>2024-05-02T00:00:00-05:00</endTime>
                        <asType>Reg-Up</asType>
                        <bidID>bid1</bidID>
                        <ASOnlyPriceCurve>
                            <startTime>2024-05-01T00:00:00-05:00</startTime>
                            <endTime>2024-05-02T05:00:00-05:00</endTime>
                            <CurveData>
                                <xvalue>24</xvalue>
                                <y1value>1.83</y1value>
                            </CurveData>
                        </ASOnlyPriceCurve>
                    </ASOnlyOffer>
                    <ASOnlyOffer>
                        <startTime>2024-05-01T00:00:00-05:00</startTime>
                        <endTime>2024-05-02T00:00:00-05:00</endTime>
                        <asType>Reg-Down</asType>
                        <bidID>bid2</bidID>
                        <ASOnlyPriceCurve>
                            <startTime>2024-05-01T00:00:00-05:00</startTime>
                            <endTime>2024-05-01T05:00:00-05:00</endTime>
                            <CurveData>
                                <xvalue>23</xvalue>
                                <y1value>1.83</y1value>
                            </CurveData>
                        </ASOnlyPriceCurve>
                    </ASOnlyOffer>
                    <ASOnlyOffer>
                        <startTime>2024-05-01T00:00:00-05:00</startTime>
                        <endTime>2024-05-02T00:00:00-05:00</endTime>
                        <asType>On-Non-Spin</asType>
                        <bidID>bid3</bidID>
                        <ASOnlyPriceCurve>
                            <startTime>2024-05-01T00:00:00-05:00</startTime>
                            <endTime>2024-05-01T05:00:00-05:00</endTime>
                            <CurveData>
                                <xvalue>23</xvalue>
                                <y1value>1.83</y1value>
                            </CurveData>
                        </ASOnlyPriceCurve>
                    </ASOnlyOffer>
                    <ASOnlyOffer>
                        <startTime>2024-05-01T00:00:00-05:00</startTime>
                        <endTime>2024-05-02T00:00:00-05:00</endTime>
                        <asType>RRSPF</asType>
                        <bidID>bid4</bidID>
                        <ASOnlyPriceCurve>
                            <startTime>2024-05-01T00:00:00-05:00</startTime>
                            <endTime>2024-05-01T05:00:00-05:00</endTime>
                            <CurveData>
                                <xvalue>25</xvalue>
                                <y1value>1.83</y1value>
                            </CurveData>
                        </ASOnlyPriceCurve>
                    </ASOnlyOffer>
                    <ASOnlyOffer>
                        <startTime>2024-05-01T00:00:00-05:00</startTime>
                        <endTime>2024-05-02T00:00:00-05:00</endTime>
                        <asType>ECRSS</asType>
                        <bidID>bid5</bidID>
                        <ASOnlyPriceCurve>
                            <startTime>2024-05-01T00:00:00-05:00</startTime>
                            <endTime>2024-05-01T05:00:00-05:00</endTime>
                            <CurveData>
                                <xvalue>26</xvalue>
                                <y1value>1.83</y1value>
                            </CurveData>
                        </ASOnlyPriceCurve>
                    </ASOnlyOffer>
                </BidSet>
            </Payload>
        </RequestMessage>
    </soapenv:Body>
</soapenv:Envelope>
